In [260]:
import pandas as pd
import numpy as np

## **Data Creation**

In [261]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN',
        'londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],
         'FlightNumber':[10045,np.nan,10065,np.nan,10085],
         'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],
         'Airline':['KLM(!)','<Air France>(12)','(British Airways.)',
                   '12.Air France',"Swiss Air"]})

# **Replacing the NaN values with 10075 and 10055**

In [262]:
ind = pd.isnull(df)
print(ind)
index = np.where(ind ==True)
print(index)
print(df['FlightNumber'][1])
for i in range(len(index)):
    x = (index[i][0])
    y = (index[i][1])
    (df['FlightNumber'][y]) = input("Enter the Flight Number")
df.dtypes
df = df.astype({'FlightNumber': int})
df.dtypes
df1 = df

   From_To  FlightNumber  RecentDelays  Airline
0    False         False         False    False
1    False          True         False    False
2    False         False         False    False
3    False          True         False    False
4    False         False         False    False
(array([1, 3]), array([1, 1]))
nan
Enter the Flight Number10075

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

Enter the Flight Number10055

# **Split the From_To column to two seperate columns From and To and Capitalise the First letter of the columns**

In [263]:
From_To= df1["From_To"].str.split("_", n = 0)
df1["From"] = [From_To[i][0] for i in range(len(df1["From_To"]))]
df1["To"] = [From_To[i][1] for i in range(len(df1["From_To"]))]
df1["From"] = df1["From"].str.title()
df1["To"] = df1["To"].str.title()
df1 = df1.drop('From_To',1)
df1

   FlightNumber  RecentDelays             Airline      From         To
0         10045      [23, 47]              KLM(!)    London      Paris
1         10055            []    <Air France>(12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways.)    London  Stockholm
3         10075          [13]       12.Air France  Budapest      Paris
4         10085      [67, 32]           Swiss Air  Brussels     London

In [264]:
df1 = df1[['From','To','FlightNumber','RecentDelays','Airline']]
df1

       From         To  FlightNumber  RecentDelays             Airline
0    London      Paris         10045      [23, 47]              KLM(!)
1    Madrid      Milan         10055            []    <Air France>(12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways.)
3  Budapest      Paris         10075          [13]       12.Air France
4  Brussels     London         10085      [67, 32]           Swiss Air

# **Splitting the RecentDelays column to three seperate columns Delay_1,Delay_2, Delay_3**

In [265]:
df2 = (pd.DataFrame(df1.pop('RecentDelays').values.tolist(), index=df1.index)

        .rename(columns = lambda x: 'Delay{}'.format(x+1)))

In [266]:
df1 = df1.join(df2)
df1 = pd.DataFrame(df1)
df1

       From         To  FlightNumber  ... Delay1  Delay2  Delay3
0    London      Paris         10045  ...   23.0    47.0     NaN
1    Madrid      Milan         10055  ...    NaN     NaN     NaN
2    London  Stockholm         10065  ...   24.0    43.0    87.0
3  Budapest      Paris         10075  ...   13.0     NaN     NaN
4  Brussels     London         10085  ...   67.0    32.0     NaN

[5 rows x 7 columns]

# **Removing the Unwanted characters in the column AIRLINE **

In [315]:
for i in range(len(AL)):
  df1['result'][i] = list([val for val in AL[i] 
               if val.isalpha()]) 
  df1['result'][i] = "".join(df1['result'][i]) 
df1['Airline'] = df1['result']
df1.drop(['result'],axis =1, inplace = True)
df1

0               KLM
1         AirFrance
2    BritishAirways
3         AirFrance
4          SwissAir
Name: result, dtype: object

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

       From         To  FlightNumber         Airline  Delay1  Delay2  Delay3
0    London      Paris         10045             KLM    23.0    47.0     NaN
1    Madrid      Milan         10055       AirFrance     NaN     NaN     NaN
2    London  Stockholm         10065  BritishAirways    24.0    43.0    87.0
3  Budapest      Paris         10075       AirFrance    13.0     NaN     NaN
4  Brussels     London         10085        SwissAir    67.0    32.0     NaN